app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "movie-test-123"], ["rating", "G"], ["director", "director-test-123"], ["created_at", "2022-10-07 23:52:24.953592"], ["updated_at", "2022-10-07 23:52:24.953592"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def find_similar_movies
    movie_id = params[:id]
    @movie = Movie.find(movie_id)
    if @movie.director == nil or @movie.director.empty?